In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import postgres_pw
import numpy as np

## Cities Table

In [2]:
cities_file = "Resources/cities.csv"
cities_df = pd.read_csv(cities_file)

In [3]:
new_cities_df = cities_df[['id', 'name', 'country']].copy()
new_cities_df = new_cities_df.rename(columns={'id':'city_id', 'name':'city_name'})
new_cities_df.head()

   city_id city_name    country
0        5  Aberdeen   Scotland
1        6  Adelaide  Australia
2        7   Algiers    Algeria
3        9    Ankara     Turkey
4       16     Belém     Brazil

## Tracks Table

In [4]:
tracks_file = "Resources/tracks.csv"
tracks_df = pd.read_csv(tracks_file)

new_tracks_df = tracks_df[['city_id','length']].copy()
track_length = new_tracks_df.groupby('city_id').sum()
track_length.reset_index(inplace=True)
pd.options.display.float_format = '{:.0f}'.format
track_length['length'] = track_length['length'].div(1609)  # convert to miles
track_length.head()

   city_id  length
0        1     915
1        4     296
2       14     392
3       15     426
4       19       1

## Track Length by City (Merged Table)

In [5]:
track_length_df = new_cities_df.merge(track_length, on='city_id')
track_length_df.sort_values(by='length', inplace=True, ascending=False)
track_length_df.reset_index(inplace=True, drop=True)
track_length_df.head()

   city_id     city_name        country  length
0      114         Tokyo          Japan    3115
1       91         Osaka          Japan    1592
2       69        London        England    1208
3        1  Buenos Aires      Argentina     915
4      206      New York  United States     836

## Stations Table

In [6]:
stations_file = "Resources/stations.csv"
stations_df = pd.read_csv(stations_file)

new_stations_df = stations_df[['city_id', 'id','name']].copy()
new_stations_df.sort_values('city_id', inplace=True)
new_stations_df.reset_index(inplace=True, drop=True)

station_count = new_stations_df.groupby('city_id')['name'].nunique()
station_count_df = pd.DataFrame(station_count)
station_count_df = station_count_df.rename(columns={'name':'station_count'})
station_count_df.reset_index(inplace=True, drop=False)
station_count_df.head()

   city_id  station_count
0        1            572
1        4            304
2        8              2
3       14            106
4       15              0

## Connect to SQL

Before running the script below, please run 'table_create_queries.sql' in pgAdmin first to create the SQL db.

In [7]:
engine = create_engine(f'postgresql://postgres:{postgres_pw}@localhost:5432/city_transit_db')

In [8]:
# Confirm tables
engine.table_names()

['cities', 'tracks', 'stations']

In [9]:
# Load data into SQL db tables
try:
    new_cities_df.to_sql(name='cities', con=engine, if_exists='append', index=False)
    print("Cities written to Postgres")
except Exception as ex:
    print("Cities data already exists.")

try:
    track_length.to_sql(name='tracks', con=engine, if_exists='append', index=False)
    print("Tracks written to Postgres")
except Exception as ex:
    print("Tracks data already exists")
    
try:
    station_count_df.to_sql(name='stations', con=engine, if_exists='append', index=False)
    print("Stations written to Postgres")
except Exception as ex:
    print("Station data already exists")

Cities data already exists.
Tracks data already exists
Station data already exists

In [10]:
pd.read_sql_query('select * from cities', con=engine).head()

   city_id city_name    country
0        5  Aberdeen   Scotland
1        6  Adelaide  Australia
2        7   Algiers    Algeria
3        9    Ankara     Turkey
4       16     Belém     Brazil

In [11]:
pd.read_sql_query('select * from tracks', con=engine).head()

   city_id  length
0        1     915
1        4     296
2       14     392
3       15     426
4       19       1

In [12]:
pd.read_sql_query('select * from stations', con=engine).head()

   city_id  station_count
0        1            572
1        4            304
2        8              2
3       14            106
4       15              0

In [13]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [14]:
# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

In [15]:
# We can view all of the classes that automap found
Base.classes.keys()

['cities', 'tracks', 'stations']

In [16]:
# Save references to each table
Cities = Base.classes.cities
Tracks = Base.classes.tracks
Stations = Base.classes.stations

In [17]:
# Create our session (link) from Python to the DB
session = Session(engine)

In [18]:
sel = [Cities.city_id, Cities.city_name, Cities.country, Tracks.length]
city_tracks = session.query(*sel).join(Tracks, Cities.city_id == Tracks.city_id).all()

city_tracks_df = pd.DataFrame(city_tracks, columns =['city_id', 'city_name', 'country', 'length'])
city_tracks_df.sort_values(['city_id'], axis=0, ascending=True, inplace=True)
city_tracks_df.head()

    city_id     city_name    country  length
71        1  Buenos Aires  Argentina     915
70        4      Santiago      Chile     296
62       14     Barcelona      Spain     392
81       15       Beijing      China     426
5        19        Berlin    Germany       1

In [19]:
sel = [Cities.city_id, Cities.city_name, Cities.country, Stations.station_count, Tracks.length]
stations_count = session.query(*sel).join(Stations, Cities.city_id == Stations.city_id).\
                                    join(Tracks, Cities.city_id == Tracks.city_id).all()

stations_count_df = pd.DataFrame(stations_count, columns =['city_id', 'city_name', 'country', 'station_count', 'length'])
stations_count_df.sort_values(['city_id'], axis=0, ascending=False, inplace=True)
stations_count_df

    city_id     city_name    country  station_count  length
25      331      Le Havre     France             23      16
26      327         Lille     France             14      53
30      325      Toulouse     France             44      28
22      324          Nice     France             17      11
23      318         Nancy     France             28      11
..      ...           ...        ...            ...     ...
5        19        Berlin    Germany             14       1
77       15       Beijing      China              0     426
58       14     Barcelona      Spain            106     392
66        4      Santiago      Chile            304     296
67        1  Buenos Aires  Argentina            572     915

[79 rows x 5 columns]